<div style='text-align:center;'><h1>Multiline Strings in Python</h1></div>

### I often have multiline string variables--such as long SQL statements--to deal with in my notebooks.  Here are a few ways I've found to deal with these values without forcing my cells scroll horizontally.

### Load packages

In [3]:
import sqlite3
import pandas as pd

# from the good people at Pivotal: https://github.com/pivotal/sql_magic
%load_ext sql_magic

The sql_magic extension is already loaded. To reload it, use:
  %reload_ext sql_magic

### Open a connection to my test sqlite database

In [4]:
conn = sqlite3.connect('mwc.db')
curs = conn.cursor()

#### Option 1: Concat multiline strings with the plus operator

In [5]:
#the old surround-the-string-with-parentheses technique
qry1 = ('SELECT fname ' +
        ',lname ' +
        ',job_title ' +
        'FROM people')

curs.execute(qry1)
curs.fetchall()

[('Al', 'Bundy', 'Shoe Salesman'),
 ('Peg', 'Bundy', 'Homemaker'),
 ('Kelly', 'Bundy', 'Verminator'),
 ('Bud', 'Bundy', 'DMV Agent'),
 ('Buck', 'Bundy', 'Dog'),
 ('Marcy', 'Darcy', 'Bank Executive'),
 ('Jefferson', 'Darcy', 'Freeloader')]

#### Option 2: Turns out, though, that I don't need to use the plus sign when I surround my string with parentheses

In [6]:
#the old surround-the-string-with-parentheses technique
qry2 = ('SELECT fname '
        ',lname '
        ',job_title '
        'FROM people')

curs.execute(qry2)
curs.fetchall()

[('Al', 'Bundy', 'Shoe Salesman'),
 ('Peg', 'Bundy', 'Homemaker'),
 ('Kelly', 'Bundy', 'Verminator'),
 ('Bud', 'Bundy', 'DMV Agent'),
 ('Buck', 'Bundy', 'Dog'),
 ('Marcy', 'Darcy', 'Bank Executive'),
 ('Jefferson', 'Darcy', 'Freeloader')]

#### Option 3: I can use a backslash to concatenate lines

In [7]:
qry3 = 'SELECT fname ' \
        ',lname ' \
        ',job_title ' \
        'FROM people'
        
curs.execute(qry3)
curs.fetchall()

[('Al', 'Bundy', 'Shoe Salesman'),
 ('Peg', 'Bundy', 'Homemaker'),
 ('Kelly', 'Bundy', 'Verminator'),
 ('Bud', 'Bundy', 'DMV Agent'),
 ('Buck', 'Bundy', 'Dog'),
 ('Marcy', 'Darcy', 'Bank Executive'),
 ('Jefferson', 'Darcy', 'Freeloader')]

#### Option 4: This is probably my favorite option--use triple quotes around my entire string block

In [8]:
qry4 = """
SELECT fname
    ,lname
    ,job_title
FROM people
"""

curs.execute(qry4)
curs.fetchall()

[('Al', 'Bundy', 'Shoe Salesman'),
 ('Peg', 'Bundy', 'Homemaker'),
 ('Kelly', 'Bundy', 'Verminator'),
 ('Bud', 'Bundy', 'DMV Agent'),
 ('Buck', 'Bundy', 'Dog'),
 ('Marcy', 'Darcy', 'Bank Executive'),
 ('Jefferson', 'Darcy', 'Freeloader')]

#### Option 5: For SQL specifically, the sql_magic magic word turns your cell into a SQL block and even loads your results in a convenient dataframe (in this case, *df_result*)

In [9]:
%%read_sql df_result -c conn
SELECT fname
    ,lname
    ,job_title
FROM people

Query started at 10:00:42 PM Eastern Daylight Time; Query executed in 0.00 m

       fname  lname       job_title
0         Al  Bundy   Shoe Salesman
1        Peg  Bundy       Homemaker
2      Kelly  Bundy      Verminator
3        Bud  Bundy       DMV Agent
4       Buck  Bundy             Dog
5      Marcy  Darcy  Bank Executive
6  Jefferson  Darcy      Freeloader

### Be a good database steward and close my connection

In [10]:
curs.close()
conn.close()

### So, what other options are there to deal with multiline strings in Python?